institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32f4.h
#define RCC     ((RCC_t *) STM_RCC_BASE)

// CR values
#define RCC_PLLI2SRDY           (1 << 27)
#define RCC_PLLI2SON            (1 << 26)
#define RCC_PLLRDY              (1 << 25)
#define RCC_PLLON               (1 << 24)
#define RCC_CSSON               (1 << 19)
#define RCC_HSEBYP              (1 << 18)
#define RCC_HSERDY              (1 << 17)
#define RCC_HSEON               (1 << 16)
#define RCC_HSICAL(n)           ((n) << 8)
#define RCC_HSITRIM(n)          ((n) << 3)
#define RCC_HSIRDY              (1 << 1)
#define RCC_HSION               (1 << 0)

// PLLCFGR values
#define RCC_PLLQ(n)             ((n) << 24)
#define RCC_PLLSRC_HSE          (1 << 22)
#define RCC_PLLP_2              (0 << 16)
#define RCC_PLLP_4              (1 << 16)
#define RCC_PLLP_6              (2 << 16)
#define RCC_PLLP_8              (3 << 16)
#define RCC_PLLN(n)             ((n) << 6)
#define RCC_PLLM(n)             (n)

// CFGR values
#define RCC_MCO2_SYSCLK         (0 << 30)
#define RCC_MCO2_PLLI2S         (1 << 30)
#define RCC_MCO2_HSE            (2 << 30)
#define RCC_MCO2_PLL            (3 << 30)
#define RCC_MCO2PRE_NODIV       (0 << 27)
#define RCC_MCO2PRE_DIV2        (4 << 27)
#define RCC_MCO2PRE_DIV3        (5 << 27)
#define RCC_MCO2PRE_DIV4        (6 << 27)
#define RCC_MCO2PRE_DIV5        (7 << 27)
#define RCC_MCO1PRE_NODIV       (0 << 24)
#define RCC_MCO1PRE_DIV2        (4 << 24)
#define RCC_MCO1PRE_DIV3        (5 << 24)
#define RCC_MCO1PRE_DIV4        (6 << 24)
#define RCC_MCO1PRE_DIV5        (7 << 24)
#define RCC_I2SSRC_EXT          (1 << 23)
#define RCC_MCO1_HSI            (0 << 21)
#define RCC_MCO1_LSE            (1 << 21)
#define RCC_MCO1_HSE            (2 << 21)
#define RCC_MCO1_PLL            (3 << 21)
#define RCC_RTCPRE              ((n) << 16)
#define RCC_PPRE2_NODIV         (0 << 13)
#define RCC_PPRE2_DIV2          (4 << 13)
#define RCC_PPRE2_DIV4          (5 << 13)
#define RCC_PPRE2_DIV8          (6 << 13)
#define RCC_PPRE2_DIV16         (7 << 13)
#define RCC_PPRE1_NODIV         (0 << 10)
#define RCC_PPRE1_DIV2          (4 << 10)
#define RCC_PPRE1_DIV4          (5 << 10)
#define RCC_PPRE1_DIV8          (6 << 10)
#define RCC_PPRE1_DIV16         (7 << 10)
#define RCC_HPRE_NODIV          (0 << 4)
#define RCC_HPRE_DIV2           (0x8 << 4)
#define RCC_HPRE_DIV4           (0x9 << 4)
#define RCC_HPRE_DIV8           (0xA << 4)
#define RCC_HPRE_DIV16          (0xB << 4)
#define RCC_HPRE_DIV64          (0xC << 4)
#define RCC_HPRE_DIV128         (0xD << 4)
#define RCC_HPRE_DIV256         (0xE << 4)
#define RCC_HPRE_DIV512         (0xF << 4)
#define RCC_SWS_HSI             (0 << 2)
#define RCC_SWS_HSE             (1 << 2)
#define RCC_SWS_PLL             (2 << 2)
#define RCC_SWS_MASK            (3 << 2)
#define RCC_SW_HSI              (0 << 0)
#define RCC_SW_HSE              (1 << 0)
#define RCC_SW_PLL              (2 << 0)
#define RCC_SW_MASK             (3 << 0)

// CIR values
#define RCC_CSSC                (1 << 23)
#define RCC_PLLI2SSDRYC         (1 << 21)
#define RCC_PLLRDYC             (1 << 20)
#define RCC_HSERDYC             (1 << 19)
#define RCC_HSIRDYC             (1 << 18)
#define RCC_LSERDYC             (1 << 17)
#define RCC_LSIRDYC             (1 << 16)
#define RCC_PLLI2SSDRYIE        (1 << 13)
#define RCC_PLLRDYIE            (1 << 12)
#define RCC_HSERDYIE            (1 << 11)
#define RCC_HSIRDYIE            (1 << 10)
#define RCC_LSERDYIE            (1 << 9)
#define RCC_LSIRDYIE            (1 << 8)
#define RCC_CSSF                (1 << 7)
#define RCC_PLLI2SSDRYF         (1 << 5)
#define RCC_PLLRDYF             (1 << 4)
#define RCC_HSERDYF             (1 << 3)
#define RCC_HSIRDYF             (1 << 2)
#define RCC_LSERDYF             (1 << 1)
#define RCC_LSIRDYF             (1 << 0)

// AHB1RSTR values
#define RCC_OTGHSRST            (1 << 29)
#define RCC_ETHMACRST           (1 << 25)
#define RCC_DMA2RST             (1 << 22)
#define RCC_DMA1RST             (1 << 21)
#define RCC_CRCRST              (1 << 12)
#define RCC_GPIOIRST            (1 << 8)
#define RCC_GPIOHRST            (1 << 7)
#define RCC_GPIOGRST            (1 << 6)
#define RCC_GPIOFRST            (1 << 5)
#define RCC_GPIOERST            (1 << 4)
#define RCC_GPIODRST            (1 << 3)
#define RCC_GPIOCRST            (1 << 2)
#define RCC_GPIOBRST            (1 << 1)
#define RCC_GPIOARST            (1 << 0)

// AHB2RSTR values
#define RCC_OTGFSRST            (1 << 7)
#define RCC_RNGRST              (1 << 6)
#define RCC_HASHRST             (1 << 5)
#define RCC_CRYPRST             (1 << 4)
#define RCC_DCMIRST             (1 << 0)

// AHB3RSTR values
#define RCC_FSMCRST             (1 << 0)

// APB1RSTR values
#define RCC_DACRST              (1 << 29)
#define RCC_PWRRST              (1 << 28)
#define RCC_CAN2RST             (1 << 26)
#define RCC_CAN1RST             (1 << 25)
#define RCC_I2C3RST             (1 << 23)
#define RCC_I2C2RST             (1 << 22)
#define RCC_I2C1RST             (1 << 21)
#define RCC_UART5RST            (1 << 20)
#define RCC_UART4RST            (1 << 19)
#define RCC_USART3RST           (1 << 18)
#define RCC_USART2RST           (1 << 17)
#define RCC_SPI3RST             (1 << 15)
#define RCC_SPI2RST             (1 << 14)
#define RCC_WWDGRST             (1 << 11)
#define RCC_TIM14RST            (1 << 8)
#define RCC_TIM13RST            (1 << 7)
#define RCC_TIM12RST            (1 << 6)
#define RCC_TIM7RST             (1 << 5)
#define RCC_TIM6RST             (1 << 4)
#define RCC_TIM5RST             (1 << 3)
#define RCC_TIM4RST             (1 << 2)
#define RCC_TIM3RST             (1 << 1)
#define RCC_TIM2RST             (1 << 0)

// APB2RSTR values
#define RCC_TIM11RST            (1 << 18)
#define RCC_TIM10RST            (1 << 17)
#define RCC_TIM9RST             (1 << 16)
#define RCC_SYSCFGRST           (1 << 14)
#define RCC_SPI1RST             (1 << 12)
#define RCC_SDIORST             (1 << 11)
#define RCC_ADCRST              (1 << 8)
#define RCC_USART6RST           (1 << 5)
#define RCC_USART1RST           (1 << 4)
#define RCC_TIM8RST             (1 << 1)
#define RCC_TIM1RST             (1 << 0)

// AHB1ENR values
#define RCC_OTGHSULPIEN         (1 << 30)
#define RCC_OTGHSEN             (1 << 29)
#define RCC_ETHMACPTPEN         (1 << 28)
#define RCC_ETHMACRXEN          (1 << 27)
#define RCC_ETHMACTXEN          (1 << 26)
#define RCC_ETHMACEN            (1 << 25)
#define RCC_DMA2EN              (1 << 22)
#define RCC_DMA1EN              (1 << 21)
#define RCC_CCMDATARAMEN        (1 << 20)
#define RCC_BKPSRAMEN           (1 << 18)
#define RCC_CRCEN               (1 << 12)
#define RCC_GPIOIEN             (1 << 8)
#define RCC_GPIOHEN             (1 << 7)
#define RCC_GPIOGEN             (1 << 6)
#define RCC_GPIOFEN             (1 << 5)
#define RCC_GPIOEEN             (1 << 4)
#define RCC_GPIODEN             (1 << 3)
#define RCC_GPIOCEN             (1 << 2)
#define RCC_GPIOBEN             (1 << 1)
#define RCC_GPIOAEN             (1 << 0)

// AHB2ENR values
#define RCC_OTGFSEN             (1 << 7)
#define RCC_RNGEN               (1 << 6)
#define RCC_HASHEN              (1 << 5)
#define RCC_CRYPEN              (1 << 4)
#define RCC_DCMIEN              (1 << 0)

// AHB3ENR values
#define RCC_FSMCEN              (1 << 0)

// APB1ENR values
#define RCC_DACEN               (1 << 29)
#define RCC_PWREN               (1 << 28)
#define RCC_CAN2EN              (1 << 26)
#define RCC_CAN1EN              (1 << 25)
#define RCC_I2C3EN              (1 << 23)
#define RCC_I2C2EN              (1 << 22)
#define RCC_I2C1EN              (1 << 21)
#define RCC_UART5EN             (1 << 20)
#define RCC_UART4EN             (1 << 19)
#define RCC_USART3EN            (1 << 18)
#define RCC_USART2EN            (1 << 17)
#define RCC_SPI3EN              (1 << 15)
#define RCC_SPI2EN              (1 << 14)
#define RCC_WWDGEN              (1 << 11)
#define RCC_TIM14EN             (1 << 8)
#define RCC_TIM13EN             (1 << 7)
#define RCC_TIM12EN             (1 << 6)
#define RCC_TIM7EN              (1 << 5)
#define RCC_TIM6EN              (1 << 4)
#define RCC_TIM5EN              (1 << 3)
#define RCC_TIM4EN              (1 << 2)
#define RCC_TIM3EN              (1 << 1)
#define RCC_TIM2EN              (1 << 0)

