institute-mpsu-miet/uos_embedded/runtime/cortex-m/io-stm32f4.h
// APB2ENR values
#define RCC_TIM11EN             (1 << 18)
#define RCC_TIM10EN             (1 << 17)
#define RCC_TIM9EN              (1 << 16)
#define RCC_SYSCFGEN            (1 << 14)
#define RCC_SPI1EN              (1 << 12)
#define RCC_SDIOEN              (1 << 11)
#define RCC_ADC3EN              (1 << 10)
#define RCC_ADC2EN              (1 << 9)
#define RCC_ADC1EN              (1 << 8)
#define RCC_USART6EN            (1 << 5)
#define RCC_USART1EN            (1 << 4)
#define RCC_TIM8EN              (1 << 1)
#define RCC_TIM1EN              (1 << 0)

// AHB1LPENR values
#define RCC_OTGHSULPILPEN       (1 << 30)
#define RCC_OTGHSLPEN           (1 << 29)
#define RCC_ETHMACPTPLPEN       (1 << 28)
#define RCC_ETHMACRXLPEN        (1 << 27)
#define RCC_ETHMACTXLPEN        (1 << 26)
#define RCC_ETHMACLPEN          (1 << 25)
#define RCC_DMA2LPEN            (1 << 22)
#define RCC_DMA1LPEN            (1 << 21)
#define RCC_BKPSRAMLPEN         (1 << 18)
#define RCC_SRAM2LPEN           (1 << 17)
#define RCC_SRAM1LPEN           (1 << 16)
#define RCC_FLITFLPEN           (1 << 15)
#define RCC_CRCLPEN             (1 << 12)
#define RCC_GPIOILPEN           (1 << 8)
#define RCC_GPIOHLPEN           (1 << 7)
#define RCC_GPIOGLPEN           (1 << 6)
#define RCC_GPIOFLPEN           (1 << 5)
#define RCC_GPIOELPEN           (1 << 4)
#define RCC_GPIODLPEN           (1 << 3)
#define RCC_GPIOCLPEN           (1 << 2)
#define RCC_GPIOBLPEN           (1 << 1)
#define RCC_GPIOALPEN           (1 << 0)

// AHB2LPENR values
#define RCC_OTGFSLPEN           (1 << 7)
#define RCC_RNGLPEN             (1 << 6)
#define RCC_HASHLPEN            (1 << 5)
#define RCC_CRYPLPEN            (1 << 4)
#define RCC_DCMILPEN            (1 << 0)

// AHB3LPENR values
#define RCC_FSMCLPEN            (1 << 0)

// APB1LPENR values
#define RCC_DACLPEN             (1 << 29)
#define RCC_PWRLPEN             (1 << 28)
#define RCC_CAN2LPEN            (1 << 26)
#define RCC_CAN1LPEN            (1 << 25)
#define RCC_I2C3LPEN            (1 << 23)
#define RCC_I2C2LPEN            (1 << 22)
#define RCC_I2C1LPEN            (1 << 21)
#define RCC_UART5LPEN           (1 << 20)
#define RCC_UART4LPEN           (1 << 19)
#define RCC_USART3LPEN          (1 << 18)
#define RCC_USART2LPEN          (1 << 17)
#define RCC_SPI3LPEN            (1 << 15)
#define RCC_SPI2LPEN            (1 << 14)
#define RCC_WWDGLPEN            (1 << 11)
#define RCC_TIM14LPEN           (1 << 8)
#define RCC_TIM13LPEN           (1 << 7)
#define RCC_TIM12LPEN           (1 << 6)
#define RCC_TIM7LPEN            (1 << 5)
#define RCC_TIM6LPEN            (1 << 4)
#define RCC_TIM5LPEN            (1 << 3)
#define RCC_TIM4LPEN            (1 << 2)
#define RCC_TIM3LPEN            (1 << 1)
#define RCC_TIM2LPEN            (1 << 0)

// APB2LPENR values
#define RCC_TIM11LPEN           (1 << 18)
#define RCC_TIM10LPEN           (1 << 17)
#define RCC_TIM9LPEN            (1 << 16)
#define RCC_SYSCFGLPEN          (1 << 14)
#define RCC_SPI1LPEN            (1 << 12)
#define RCC_SDIOLPEN            (1 << 11)
#define RCC_ADC3LPEN            (1 << 10)
#define RCC_ADC2LPEN            (1 << 9)
#define RCC_ADC1LPEN            (1 << 8)
#define RCC_USART6LPEN          (1 << 5)
#define RCC_USART1LPEN          (1 << 4)
#define RCC_TIM8LPEN            (1 << 1)
#define RCC_TIM1LPEN            (1 << 0)

// BDCR values
#define RCC_BDRST               (1 << 16)
#define RCC_RTCEN               (1 << 15)
#define RCC_RTCSEL_NOCLK        (0 << 8)
#define RCC_RTCSEL_LSE          (1 << 8)
#define RCC_RTCSEL_LSI          (2 << 8)
#define RCC_RTCSEL_HSE          (3 << 8)
#define RCC_LSEBYP              (1 << 2)
#define RCC_LSERDY              (1 << 1)
#define RCC_LSEON               (1 << 0)

// CSR values
#define RCC_LPWRRSTF            (1 << 31)
#define RCC_WWDGRSTF            (1 << 30)
#define RCC_IWDGRSTF            (1 << 29)
#define RCC_SFTRSTF             (1 << 28)
#define RCC_PORRSTF             (1 << 27)
#define RCC_PINRSTF             (1 << 26)
#define RCC_BORRSTF             (1 << 25)
#define RCC_RMVF                (1 << 24)
#define RCC_LSIRDY              (1 << 1)
#define RCC_LSION               (1 << 0)

// SSCGR values
#define RCC_SSCGEN              (1 << 31)
#define RCC_SPREADSEL           (1 << 30)
#define RCC_INCSTEP(n)          ((n) << 13)
#define RCC_MODPER(n)           (n)

// PLLI2SCFGR
#define RCC_PLLI2SR(n)          ((n) << 28)
#define RCC_PLLI2SN(n)          ((n) << 6)


/////////////////////////////////////////
// Flash interface
/////////////////////////////////////////
typedef struct
{
    arm_reg_t ACR;
    arm_reg_t KEYR;
    arm_reg_t OPTKEYR;
    arm_reg_t SR;
    arm_reg_t CR;
    arm_reg_t OPTCR;
} FLASH_t;

#define FLASH_IFACE     ((FLASH_t*) STM_FLASH_IFACE_BASE)

// ACR values
#define FLASH_DCRST             (1 << 12)
#define FLASH_ICRST             (1 << 11)
#define FLASH_DCEN              (1 << 10)
#define FLASH_ICEN              (1 << 9)
#define FLASH_PRFTEN            (1 << 8)
#define FLASH_LATENCY(n)        (n)

// KEYR values
#define FLASH_KEY1              0x45670123
#define FLASH_KEY2              0xCDEF89AF

// OPTKEYR values
#define FLASH_OPTKEY1           0x08192A3B
#define FLASH_OPTKEY2           0x4C5D6E7F

// SR values
#define FLASH_BSY               (1 << 16)
#define FLASH_PGSERR            (1 << 7)
#define FLASH_PGPERR            (1 << 6)
#define FLASH_PGAERR            (1 << 5)
#define FLASH_WRPERR            (1 << 4)
#define FLASH_OPERR             (1 << 1)
#define FLASH_EOP               (1 << 0)

// CR values
#define FLASH_LOCK              (1 << 31)
#define FLASH_ERRIE             (1 << 25)
#define FLASH_EOPIE             (1 << 24)
#define FLASH_STRT              (1 << 16)
#define FLASH_PSIZE_8           (0 << 8)
#define FLASH_PSIZE_16          (1 << 8)
#define FLASH_PSIZE_32          (2 << 8)
#define FLASH_PSIZE_64          (3 << 8)
#define FLASH_SNB(n)            ((n) << 3)
#define FLASH_MER               (1 << 2)
#define FLASH_SER               (1 << 1)
#define FLASH_PG                (1 << 0)

